Autodesk.Revit.DB.Structure.AreaLoad.Curve(System.Int32,System.Int32)
Returns the geometric curve within a geometric loop that defines the area.
loopIndex: The index of the geometric loop.
curveIndex: The index curve within the loop.
Remarks: The loop index should be between 0 and less than NumLoops. The curve index should be
between 0 and less than NumCurves(loopIndex).

Autodesk.Revit.DB.Structure.AreaLoad.NumCurves(System.Int32)
Returns the number of curves within a geometric loop that defines the area.
index: The index of the geometric loop.
Remarks: The index should be between 0 and less than NumLoops.

Autodesk.Revit.DB.Structure.AreaLoad.NumLoops
Returns the number of geometric curve loops that define the area.

Autodesk.Revit.DB.Structure.AreaLoad.RefPoint(System.Int32)
Retrieve the physical location of the reference point.
index: The index of the point to return.
Remarks: The index should be between 0 and less than NumRefPoints.

Autodesk.Revit.DB.Structure.AreaLoad.Force(System.Int32)
Returns the three dimensional force applied to one of the points for the area load.
index: The index of the point to return.
Remarks: The index should be between 0 and less than NumRefPoints. The force is measured in Kg / Sec*Feet.

Autodesk.Revit.DB.Structure.AreaLoad.Force3
Returns the three dimensional force applied to the point 3 of the area load.
Remarks: The force is measured in Kg / Sec*Feet.

Autodesk.Revit.DB.Structure.AreaLoad.Force2
Returns the three dimensional force applied to the point 2 of the area load.
Remarks: The force is measured in Kg / Sec*Feet.

Autodesk.Revit.DB.Structure.AreaLoad.Force1
Returns the three dimensional force applied to the point 1 of the area load.
Remarks: The force is measured in Kg / Sec*Feet.